"QALD id","match status","QALD question","QueGG question","QALD SPARQL query","QueGG SPARQL query","TP","FP","FN","Precision","Recall","F-Measure"
"1","0.6363636363636364","List all the musicals with music by Elton John.","""List all the with music  Elton John""","PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uriWHERE {         ?uri rdf:type dbo:Musical .        ?uri dbo:musicBy res:Elton_John .}","""select  ?s    {   ?s <http://dbpedia.org/ontology/musicBy>  <http://dbpedia.org/resource/Elton_John> .    }""","4.0","0.0","0.0","1.0","1.0","1.0"
"51","0.0","Give me all actors starring in movies directed by William Shatner.","","SELECT DISTINCT ?uri WHERE {  ?x <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/William_Shatner> .  ?x <http://dbpedia.org/ontology/starring> ?uri . } ","","0.0","0.0","18.0","0.0","0.0","0.0"
"53","0.6666666666666666","Give me all professional skateboarders from Sweden.","Give me all professional Swedish skateboarders.","PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX dbp: <http://dbpedia.org/property/>PREFIX res: <http://dbpedia.org/resource/>SELECT DISTINCT ?uri WHERE {	?uri dbo:occupation res:Skateboarding .         { ?uri dbo:birthPlace res:Sweden . }        UNION        { ?uri dbo:birthPlace ?place .           ?place dbo:country res:Sweden . }}","SELECT ?s WHERE {  ?s <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Skateboarding> .     ?s  <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Sweden> . }","0.0","1.0","2.0","0.0","0.0","0.0"
"62","0.0","List all episodes of the first season of the HBO television series The Sopranos!","","PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>SELECT DISTINCT ?uri WHERE {	?uri dbo:series res:The_Sopranos  .        ?uri dbo:seasonNumber 1 .}","","0.0","0.0","86.0","0.0","0.0","0.0"
"67","0.0","Give me all launch pads operated by NASA.","","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE {         ?uri rdf:type dbo:LaunchPad .          ?uri dbo:operator res:NASA . }","","0.0","0.0","9.0","0.0","0.0","0.0"
"70","0.6","Who created Batman?","""Who created Netherlands?""","SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Batman> <http://dbpedia.org/ontology/creator> ?uri . } ","""select  ?s    {   ?s <http://dbpedia.org/ontology/creator>  <http://dbpedia.org/resource/Netherlands> .    }""","0.0","0.0","2.0","0.0","0.0","0.0"
"78","0.0","Give me all video games published by Mean Hamster Software.","","PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>SELECT DISTINCT ?uri WHERE {      ?uri rdf:type dbo:VideoGame .      ?uri dbo:publisher res:Mean_Hamster_Software . }","","0.0","0.0","2.0","0.0","0.0","0.0"
"83","0.0","Give me all movies directed by Francis Ford Coppola.","","SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> .  ?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Francis_Ford_Coppola> . } ","","0.0","0.0","30.0","0.0","0.0","0.0"
"88","0.0","Give me the grandchildren of Elvis Presley.","","SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Elvis_Presley> <http://dbpedia.org/ontology/child> ?child . ?child <http://dbpedia.org/ontology/child> ?uri . }","","0.0","0.0","1.0","0.0","0.0","0.0"
"95","0.0","Give me all Canadian Grunge record labels.","","PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>SELECT DISTINCT ?uri WHERE {	?uri rdf:type dbo:RecordLabel .        ?uri dbo:genre res:Grunge .        ?uri dbo:country res:Canada .}","","0.0","0.0","1.0","0.0","0.0","0.0"
"97","0.0","List the children of Margaret Thatcher.","","PREFIX res: <http://dbpedia.org/resource/>PREFIX dbo: <http://dbpedia.org/ontology/>SELECT DISTINCT ?uri WHERE {	res:Margaret_Thatcher dbo:child ?uri .}","","0.0","0.0","2.0","0.0","0.0","0.0"
"102","0.5555555555555556","List all games by GMT.","""List all video games developed by GMT Games?""","PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>SELECT DISTINCT ?uri WHERE {	        ?uri dbo:publisher res:GMT_Games .}","""select  ?s    {   ?s <http://dbpedia.org/ontology/publisher>  <http://dbpedia.org/resource/GMT_Games> .    }""","7.0","0.0","0.0","1.0","1.0","1.0"
"126","0.0","Give me the currency of China.","","PREFIX res: <http://dbpedia.org/resource/>PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uriWHERE {     res:China dbo:currency ?uri . }","","0.0","0.0","1.0","0.0","0.0","0.0"
"143","1.0","Show me the book that Muhammad Ali wrote.","Show me the book that Muhammad Ali wrote.","PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE {          ?uri rdf:type dbo:Book .          ?uri dbo:author res:Muhammad_Ali . }","select ?s {?s <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Muhammad_Ali> . }","1.0","0.0","0.0","1.0","1.0","1.0"
"146","0.0","Give me all actors starring in Last Action Hero.","","PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>SELECT DISTINCT ?uriWHERE {        res:Last_Action_Hero dbo:starring ?uri . }","","0.0","0.0","9.0","0.0","0.0","0.0"
"177","0.0","Give me all Swedish oceanographers.","Give me all Swedish oceanographers.","PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>SELECT DISTINCT ?uriWHERE {        ?uri dbo:field res:Oceanography .         ?uri dbo:birthPlace res:Sweden .        }","SELECT DISTINCT ?s WHERE { ?s <http://dbpedia.org/ontology/field>  <http://dbpedia.org/resource/Oceanography> . ?s <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Sweden> . }","0.0","2.0","42.0","0.0","0.0","0.0"
"188","0.0","Give me all books by William Goldman with more than 300 pages.","","PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>SELECT DISTINCT ?uri WHERE {        ?uri rdf:type dbo:Book .        ?uri dbo:author res:William_Goldman .        ?uri dbo:numberOfPages ?x .        FILTER (?x > 300)}","","0.0","0.0","10.0","0.0","0.0","0.0"
"196","0.0","Give me all cities in New Jersey with more than 100000 inhabitants.","","PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX dbp: <http://dbpedia.org/property/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>SELECT DISTINCT ?uri WHERE {	?uri rdf:type dbo:City .        ?uri dbo:isPartOf res:New_Jersey .        ?uri dbp:populationTotal ?inhabitants .        FILTER (?inhabitants > 100000) .}","","0.0","0.0","0.0","0.0","0.0","0.0"
"204","0.0","Give me all members of Prodigy.","","SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/The_Prodigy> <http://dbpedia.org/ontology/bandMember> ?uri . } ","","0.0","0.0","3.0","0.0","0.0","0.0"
"212","0.0","Is Cola a beverage?","","PREFIX dbo: <http://dbpedia.org/ontology/>PREFIX res: <http://dbpedia.org/resource/>PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>ASK WHERE {        res:Cola rdf:type dbo:Beverage .}","","0.0","0.0","1.0","0.0","0.0","0.0"
